In [2]:
import pandas as pd
a1 = [[1,2,3], [4,5,6,], [7,8,9]]
df1 = pd.DataFrame(a1, columns=list("ABC"), index=list("가나다"))
df2 = df1.reindex(columns=list("BCA"), index=list("나다가")).copy()
sr1 = df1.loc["가"]
df3 = df1.iloc[:2,:2]
df1

   A  B  C
가  1  2  3
나  4  5  6
다  7  8  9

In [3]:
df1 * df1 # 각 자리마다 전부 제곱 # 데이터프레임 연산

    A   B   C
가   1   4   9
나  16  25  36
다  49  64  81

In [4]:
df1 + df1 # 각 자리마다 합 # index와 columns에 맟춰서 연산됨

    A   B   C
가   2   4   6
나   8  10  12
다  14  16  18

In [5]:
df1 + df3 # 크기가 다른 연산 -> NaN으로 처리됨

     A     B   C
가  2.0   4.0 NaN
나  8.0  10.0 NaN
다  NaN   NaN NaN

In [7]:
df1.add(df2, fill_value=0) # 없는 값을 0으로 채워놓고 연산을 하라

    A   B   C
가   2   4   6
나   8  10  12
다  14  16  18

In [8]:
df1 + sr1 # BroadCasting을 이해 # sr1의 세로방향이 티폴트

   A   B   C
가  2   4   6
나  5   7   9
다  8  10  12

In [11]:
df1.add(sr1, axis=0) # 축 지정 # sr1 브로드캐스팅 한 부분(A~C)

    A   B   C
A NaN NaN NaN
B NaN NaN NaN
C NaN NaN NaN
가 NaN NaN NaN
나 NaN NaN NaN
다 NaN NaN NaN